FaBoPlatform/arduino-board-packages/packages/fabo-avr-0.0.3/boards.txt
# FaBo AVR Boards

##############################################################

fabodonkey.name=FaBo Donkey

fabodonkey.upload.tool=arduino:avrdude
fabodonkey.upload.protocol=arduino
fabodonkey.upload.maximum_size=30720
fabodonkey.upload.maximum_data_size=2048
fabodonkey.upload.speed=57600

fabodonkey.bootloader.tool=arduino:avrdude
fabodonkey.bootloader.unlock_bits=0x3F
fabodonkey.bootloader.lock_bits=0x0F
fabodonkey.bootloader.low_fuses=0xFF
fabodonkey.bootloader.high_fuses=0xDA
fabodonkey.bootloader.extended_fuses=0xFD
fabodonkey.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

fabodonkey.build.board=AVR_DONKEY
fabodonkey.build.core=arduino:arduino
fabodonkey.build.variant=arduino:standard
fabodonkey.build.mcu=atmega328p
fabodonkey.build.f_cpu=16000000L

